20240612T011737--kdoc-189-goでスライスがどのように保存されているか調べる__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:13:04Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 189: Goでスライスがどのように保存されているか調べる</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 189: Goでスライスがどのように保存されているか調べる</h1>
<div id="outline-container-org9a425f7" class="outline-2">
<h2 id="org9a425f7"><a href="#org9a425f7">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org9a425f7">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-06-20 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-06-20 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgcc0c26f" class="outline-2">
<h2 id="orgcc0c26f"><a href="#orgcc0c26f">概要</a></h2>
<div class="outline-text-2" id="text-orgcc0c26f">
<p>
<a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>でスライスが、どのようにメモリに保存されているか調べる。
</p>
</div>
</div>
<div id="outline-container-org7a28892" class="outline-2">
<h2 id="org7a28892"><a href="#org7a28892">調べる</a></h2>
<div class="outline-text-2" id="text-org7a28892">
<p>
まず、スライスの定義は↓のようになっており、配列の先頭要素へのポインタにすぎない。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>スライスの定義</label><pre class="src src-go">type slice struct {
	array unsafe.Pointer
	len   int
	cap   int
}
</pre>
</div>

<p>
したがって、それぞれの要素を先頭にしたスライスを作り指すポインタを見ると、それぞれ位置するアドレスがわかる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>s1~s3のポインタから、スライスの要素はメモリに1バイトずつ保存されていることがわかる。s4はcapを超えてappendされ、スライスのコピーが走って別の位置に保存される</label><pre class="src src-go">func main(){
        s1 := []byte{1, 2, 3}
        s2 := s1[1:]
        s3 := s1[2:]
        s4 := s1
        s4 = append(s4, 4)
        fmt.Printf("s1: %v, addr: %p, len: %d, cap: %d\n", s1, s1, len(s1), cap(s1))
        fmt.Printf("s2: %v, addr: %p, len: %d, cap: %d\n", s2, s2, len(s2), cap(s2))
        fmt.Printf("s3: %v, addr: %p, len: %d, cap: %d\n", s3, s3, len(s3), cap(s3))
        fmt.Printf("s4: %v, addr: %p, len: %d, cap: %d\n", s4, s4, len(s4), cap(s4))
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">s1: [1 2 3], addr: 0xc0000120e0, len: 3, cap: 3
s2: [2 3], addr: 0xc0000120e1, len: 2, cap: 2
s3: [3], addr: 0xc0000120e2, len: 1, cap: 1
s4: [1 2 3 4], addr: 0xc0000120e8, len: 4, cap: 8
</pre>
</div>

<p>
図にするとこうなる。再割り当てされる位置は元の位置と空いているが、その箇所には何が入っているのだろうか。どうやって調べればよいか。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>スライスの値とポインタの図</label><pre class="src src-nil">addr 0 1 2 3 4 5 6 7 8 9 a b
val  1 2 3 ? ? ? ? ? 1 2 3 4
</pre>
</div>
</div>
</div>
<div id="outline-container-org5a55db1" class="outline-2">
<h2 id="org5a55db1"><a href="#org5a55db1">関連</a></h2>
<div class="outline-text-2" id="text-org5a55db1">
<ul class="org-ul">
<li><a href="20240608T113006--kdoc-188-『visual-guide-to-slices-in-go』__book.html#ID-20240608T113006">KDOC 188: 『Visual Guide to Slices in Go』</a>。読んで参考にした元ネタ。実際に試してみた</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
